Revit 2024 API
DeleteWorksetSettings.DeleteWorksetOption Property
 The current delete workset option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public DeleteWorksetOption DeleteWorksetOption { get; set; }
Visual Basic
Public Property DeleteWorksetOption As DeleteWorksetOption
	Get
	Set
Visual C++
public:
property DeleteWorksetOption DeleteWorksetOption {
	DeleteWorksetOption get ();
	void set (DeleteWorksetOption value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace